app/controllers/posts_controller.rb

  def index
    render json: Post.all
---
SELECT "posts".* FROM "posts"