app/controllers/recipes_controller.rb

  def index
    render json: Recipe.all
---
SELECT "recipes".* FROM "recipes"

  def show
    recipe = Recipe.find_by(id: params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    recipe = @current_user.recipes.create!(recipe_params)
---
INSERT INTO "recipes" ("user_id", "title", "instructions", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "testing"], ["instructions", "testing this once again"], ["created_at", "2022-05-03 15:49:39.684231"], ["updated_at", "2022-05-03 15:49:39.684231"]]