app/controllers/sessions_controller.rb

    def create
        @user = User.find_by(username: session_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "test"], ["LIMIT", 1]]